InformationRegisters/ABCКлассификацияНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>ABCКлассификацияНоменклатуры</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Класс</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ABCКлассификация</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеПараметраКлассификации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбъектКлассификации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.ТорговыеНаименования</v8:Type>
						<v8:Type>cfg:CatalogRef.КлючиАналитикиОписанийОтборовНоменклатуры</v8:Type>
						<v8:Type>cfg:CatalogRef.ДействующиеВеществаМНН</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РазделКлассификации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипОбъектаКлассификации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыОбъектовКлассификации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипПараметраКлассификации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыПараметровКлассификации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/Закупки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<AccumulationRegister>
		<Properties>
			<Name>Закупки</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Comment>Количество товара</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Comment>Сумма в валюте регламентированного учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаБезНДС</Name>
					<Comment>Сумма в валюте регламентированного учета без НДС</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДС</Name>
					<Comment>НДС в валюте регламентированного учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимостьБезНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимостьРегл</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДокументДвижения</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровПоставщику</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетСебестоимости</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоменклатураЗаказа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИсточникФинансирования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиФинансирования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>АналитикаУчетаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлючиАналитикиУчетаНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументЗакупки</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказПоставщику</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Спецификация</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СпецификацияКДоговору</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/АналитикаУчетаНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>АналитикаУчетаНоменклатуры</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КлючАналитики</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлючиАналитикиУчетаНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПартииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/АналитикаОписанийОтборовНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>АналитикаОписанийОтборовНоменклатуры</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КлючАналитики</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлючиАналитикиОписанийОтборовНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТорговоеНаименование</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТорговыеНаименования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДействующиеВеществаМНН</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДействующиеВеществаМНН</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФормаВыпуска</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФормыВыпуска</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТипыОбъектовКлассификации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>ТипыОбъектовКлассификации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Номенклатура</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДействующиеВеществаМНН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДействующиеВеществаМНН_ФормаВыпуска</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТорговоеНаименование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТорговоеНаименование_ФормаВыпуска</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыПараметровКлассификации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>ТипыПараметровКлассификации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЗакупкиСумма</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗакупкиКоличество</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ABCКлассификация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>ABCКлассификация</Name>
			<Comment>(Упр)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>AКласс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>BКласс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>CКласс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеКлассифицирован</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ТорговыеНаименования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>ТорговыеНаименования</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АнглийскоеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткоеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДействующиеВеществаМНН</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДействующиеВеществаМНН</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/КлючиАналитикиОписанийОтборовНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>КлючиАналитикиОписанийОтборовНоменклатуры</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТорговоеНаименование</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТорговыеНаименования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДействующиеВеществаМНН</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДействующиеВеществаМНН</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормаВыпуска</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФормыВыпуска</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/ABCКлассификацияНоменклатуры/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС
#Область ПрограммныйИнтерфейс

// Очищает всю информацию ABC-классификации номенклатуры.
//
Процедура ОчиститьABCКлассификацию() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	НаборЗаписей = РегистрыСведений.ABCКлассификацияНоменклатуры.СоздатьНаборЗаписей();
	НаборЗаписей.Записать();
	
КонецПроцедуры

// Выполняет расчет ABC класса номенклатуры и записывает его в регистр
//
//	Параметры:
//		ДатаКлассификации - Дата - дата окончания периода, за который нужно выбрать данные для
//			классификации, если Неопределенно - используется текущая дата
//
Процедура ВыполнитьABCКлассификацию(ДатаКлассификации = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ИспользоватьABCКлассификациюПоСуммеЗакупок = Константы.ИспользоватьABCКлассификациюНоменклатурыПоСуммеЗакупок.Получить();
	ИспользоватьABCКлассификациюПоКоличествуЗакупок = Константы.ИспользоватьABCКлассификациюНоменклатурыПоКоличествуЗакупок.Получить();
	
	Если Не ИспользоватьABCКлассификациюПоСуммеЗакупок И Не ИспользоватьABCКлассификациюПоКоличествуЗакупок Тогда
		Возврат;
	КонецЕсли;
	
	ПериодКлассификации = Константы.ПериодABCКлассификацииНоменклатуры.Получить();
	КоличествоПериодовКлассификации = Константы.КоличествоПериодовABCКлассификацииНоменклатуры.Получить();
	
	Если ПериодКлассификации.Пустая() Или КоличествоПериодовКлассификации = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Закупки.Организация КАК Организация,
	|	Закупки.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
	|	АналитикаНоменклатуры.Номенклатура КАК Номенклатура,
	|	АналитикаНоменклатуры.Номенклатура.ЭтоЛекарственноеСредство КАК ЭтоЛекарственноеСредство,
	|	ВЫБОР
	|		КОГДА АналитикаНоменклатуры.Номенклатура.ТипНоменклатурыРасширенный = ЗНАЧЕНИЕ(Справочник.ТипыНоменклатурыРасширенные.ЛекарственноеСредство)
	|			ТОГДА АналитикаНоменклатуры.Номенклатура.ЭлементКАТ.ТорговоеНаименование
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ТорговыеНаименования.ПустаяСсылка)
	|	КОНЕЦ КАК ТорговоеНаименование,
	|	ВЫБОР
	|		КОГДА АналитикаНоменклатуры.Номенклатура.ТипНоменклатурыРасширенный = ЗНАЧЕНИЕ(Справочник.ТипыНоменклатурыРасширенные.ЛекарственноеСредство)
	|			ТОГДА АналитикаНоменклатуры.Номенклатура.ЭлементКАТ.ДействующиеВеществаМНН
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДействующиеВеществаМНН.ПустаяСсылка)
	|	КОНЕЦ КАК ДействующиеВеществаМНН,
	|	ЕСТЬNULL(АналитикаНоменклатуры.Номенклатура.ЭлементКАТ.ФормаВыпуска, ЗНАЧЕНИЕ(Справочник.ФормыВыпуска.ПустаяСсылка)) КАК ФормаВыпуска,
	|	ЕСТЬNULL(АналитикиОписанийНоменклатура.КлючАналитики, НЕОПРЕДЕЛЕНО) КАК АналитикаОписанияНоменклатуры,
	|	ЕСТЬNULL(АналитикиОписанийТорговоеНаименование.КлючАналитики, НЕОПРЕДЕЛЕНО) КАК АналитикаОписанияТорговогоНаименования,
	|	ЕСТЬNULL(АналитикиОписанийДействующиеВеществаМНН.КлючАналитики, НЕОПРЕДЕЛЕНО) КАК АналитикаОписанияДействующихВеществМНН,
	|	Закупки.СуммаОборот КАК Сумма,
	|	Закупки.КоличествоОборот КАК Количество
	|ПОМЕСТИТЬ ИсточникДанных
	|ИЗ
	|	РегистрНакопления.Закупки.Обороты(&НачалоПериода, &ОкончаниеПериода, , ) КАК Закупки
	|		ЛЕВОЕ СОЕДИНЕНИЕ
	|			РегистрСведений.АналитикаУчетаНоменклатуры КАК АналитикаНоменклатуры
	|			ПО
	|				АналитикаНоменклатуры.КлючАналитики = Закупки.АналитикаУчетаНоменклатуры
	|		ЛЕВОЕ СОЕДИНЕНИЕ
	|			РегистрСведений.АналитикаОписанийОтборовНоменклатуры КАК АналитикиОписанийНоменклатура
	|			ПО
	|				АналитикаНоменклатуры.Номенклатура = АналитикиОписанийНоменклатура.Номенклатура
	|				И ((НЕ АналитикаНоменклатуры.Номенклатура.ЭтоЛекарственноеСредство)
	|				ИЛИ (ВЫБОР
	|						КОГДА АналитикаНоменклатуры.Номенклатура.ТипНоменклатурыРасширенный = ЗНАЧЕНИЕ(Справочник.ТипыНоменклатурыРасширенные.ЛекарственноеСредство)
	|							ТОГДА АналитикаНоменклатуры.Номенклатура.ЭлементКАТ.ТорговоеНаименование
	|						ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ТорговыеНаименования.ПустаяСсылка)
	|					КОНЕЦ = АналитикиОписанийНоменклатура.ТорговоеНаименование
	|					И ВЫБОР
	|						КОГДА АналитикаНоменклатуры.Номенклатура.ТипНоменклатурыРасширенный = ЗНАЧЕНИЕ(Справочник.ТипыНоменклатурыРасширенные.ЛекарственноеСредство)
	|							ТОГДА АналитикаНоменклатуры.Номенклатура.ЭлементКАТ.ДействующиеВеществаМНН
	|						ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДействующиеВеществаМНН.ПустаяСсылка)
	|					КОНЕЦ = АналитикиОписанийНоменклатура.ДействующиеВеществаМНН
	|					И АналитикаНоменклатуры.Номенклатура.ЭлементКАТ.ФормаВыпуска = АналитикиОписанийНоменклатура.ФормаВыпуска)
	|				)
	|		ЛЕВОЕ СОЕДИНЕНИЕ
	|			РегистрСведений.АналитикаОписанийОтборовНоменклатуры КАК АналитикиОписанийТорговоеНаименование
	|			ПО
	|					(НЕ АналитикаНоменклатуры.Номенклатура.ЭтоЛекарственноеСредство)
	|					И АналитикаНоменклатуры.Номенклатура = АналитикиОписанийТорговоеНаименование.Номенклатура
	|				ИЛИ
	|					(АналитикаНоменклатуры.Номенклатура.ЭтоЛекарственноеСредство)
	|					И АналитикиОписанийТорговоеНаименование.Номенклатура =
	|						ВЫБОР
	|							КОГДА АналитикаНоменклатуры.Номенклатура.ЭлементКАТ.ТорговоеНаименование = ЗНАЧЕНИЕ(Справочник.ТорговыеНаименования.ПустаяСсылка)
	|								ТОГДА АналитикаНоменклатуры.Номенклатура
	|							ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|						КОНЕЦ
	|					И АналитикаНоменклатуры.Номенклатура.ЭлементКАТ.ТорговоеНаименование = АналитикиОписанийТорговоеНаименование.ТорговоеНаименование
	|					И ВЫБОР
	|						КОГДА АналитикаНоменклатуры.Номенклатура.ТипНоменклатурыРасширенный = ЗНАЧЕНИЕ(Справочник.ТипыНоменклатурыРасширенные.ЛекарственноеСредство)
	|							ТОГДА АналитикаНоменклатуры.Номенклатура.ЭлементКАТ.ДействующиеВеществаМНН
	|						ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДействующиеВеществаМНН.ПустаяСсылка)
	|					КОНЕЦ = АналитикиОписанийТорговоеНаименование.ДействующиеВеществаМНН
	|					И АналитикаНоменклатуры.Номенклатура.ЭлементКАТ.ФормаВыпуска = АналитикиОписанийТорговоеНаименование.ФормаВыпуска
	|		ЛЕВОЕ СОЕДИНЕНИЕ
	|			РегистрСведений.АналитикаОписанийОтборовНоменклатуры КАК АналитикиОписанийДействующиеВеществаМНН
	|			ПО
	|					(НЕ АналитикаНоменклатуры.Номенклатура.ЭтоЛекарственноеСредство)
	|					И АналитикаНоменклатуры.Номенклатура = АналитикиОписанийДействующиеВеществаМНН.Номенклатура
	|				ИЛИ
	|					(АналитикаНоменклатуры.Номенклатура.ЭтоЛекарственноеСредство)
	|					И АналитикиОписанийДействующиеВеществаМНН.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|					И ВЫБОР
	|						КОГДА АналитикаНоменклатуры.Номенклатура.ТипНоменклатурыРасширенный = ЗНАЧЕНИЕ(Справочник.ТипыНоменклатурыРасширенные.ЛекарственноеСредство)
	|							ТОГДА АналитикаНоменклатуры.Номенклатура.ЭлементКАТ.ТорговоеНаименование
	|						ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ТорговыеНаименования.ПустаяСсылка)
	|					КОНЕЦ = АналитикиОписанийДействующиеВеществаМНН.ТорговоеНаименование
	|					И ВЫБОР
	|						КОГДА АналитикаНоменклатуры.Номенклатура.ТипНоменклатурыРасширенный = ЗНАЧЕНИЕ(Справочник.ТипыНоменклатурыРасширенные.ЛекарственноеСредство)
	|							ТОГДА АналитикаНоменклатуры.Номенклатура.ЭлементКАТ.ДействующиеВеществаМНН
	|						ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДействующиеВеществаМНН.ПустаяСсылка)
	|					КОНЕЦ = АналитикиОписанийДействующиеВеществаМНН.ДействующиеВеществаМНН
	|					И АналитикаНоменклатуры.Номенклатура.ЭлементКАТ.ФормаВыпуска = АналитикиОписанийДействующиеВеществаМНН.ФормаВыпуска
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	// 1 Классификация Номенклатуры
	// 1.1 Данные для классификация в целом по предприятию
	|ВЫБРАТЬ
	|	0 КАК РазделительКлассификации,
	|	НЕОПРЕДЕЛЕНО КАК РазделКлассификации,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыОбъектовКлассификации.Номенклатура) КАК ТипОбъектаКлассификации,
	|	ИсточникДанных.Номенклатура КАК Номенклатура,
	|	ИсточникДанных.ТорговоеНаименование КАК ТорговоеНаименование,
	|	ИсточникДанных.ДействующиеВеществаМНН КАК ДействующиеВеществаМНН,
	|	ИсточникДанных.ФормаВыпуска КАК ФормаВыпуска,
	|	ИсточникДанных.АналитикаОписанияНоменклатуры КАК ОбъектКлассификации,
	|	СУММА(ИсточникДанных.Сумма) КАК Сумма,
	|	СУММА(Количество) КАК Количество
	|ИЗ
	|	ИсточникДанных КАК ИсточникДанных
	|
	|СГРУППИРОВАТЬ ПО
	|	ИсточникДанных.Номенклатура,
	|	ИсточникДанных.ТорговоеНаименование,
	|	ИсточникДанных.ДействующиеВеществаМНН,
	|	ИсточникДанных.ФормаВыпуска,
	|	ИсточникДанных.АналитикаОписанияНоменклатуры
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	// 1.2 Данные для классификация в разрезе организаций
	|ВЫБРАТЬ
	|	1,
	|	ИсточникДанных.Организация,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыОбъектовКлассификации.Номенклатура),
	|	ИсточникДанных.Номенклатура,
	|	ИсточникДанных.ТорговоеНаименование,
	|	ИсточникДанных.ДействующиеВеществаМНН,
	|	ИсточникДанных.ФормаВыпуска,
	|	ИсточникДанных.АналитикаОписанияНоменклатуры,
	|	СУММА(ИсточникДанных.Сумма),
	|	СУММА(Количество)
	|ИЗ
	|	ИсточникДанных КАК ИсточникДанных
	|
	|СГРУППИРОВАТЬ ПО
	|	ИсточникДанных.Организация,
	|	ИсточникДанных.Номенклатура,
	|	ИсточникДанных.ТорговоеНаименование,
	|	ИсточникДанных.ДействующиеВеществаМНН,
	|	ИсточникДанных.ФормаВыпуска,
	|	ИсточникДанных.АналитикаОписанияНоменклатуры
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	// 1.3 Данные для классификация в разрезе подразделений организаций
	|ВЫБРАТЬ
	|	2,
	|	ИсточникДанных.ПодразделениеОрганизации,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыОбъектовКлассификации.Номенклатура),
	|	ИсточникДанных.Номенклатура,
	|	ИсточникДанных.ТорговоеНаименование,
	|	ИсточникДанных.ДействующиеВеществаМНН,
	|	ИсточникДанных.ФормаВыпуска,
	|	ИсточникДанных.АналитикаОписанияНоменклатуры,
	|	СУММА(ИсточникДанных.Сумма),
	|	СУММА(Количество)
	|ИЗ
	|	ИсточникДанных КАК ИсточникДанных
	|
	|СГРУППИРОВАТЬ ПО
	|	ИсточникДанных.ПодразделениеОрганизации,
	|	ИсточникДанных.Номенклатура,
	|	ИсточникДанных.ТорговоеНаименование,
	|	ИсточникДанных.ДействующиеВеществаМНН,
	|	ИсточникДанных.ФормаВыпуска,
	|	ИсточникДанных.АналитикаОписанияНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	// 2 Классификация Торговых наименований + формы выпуска
	// 2.1 Данные для классификация в целом по предприятию
	|ВЫБРАТЬ
	|	0 КАК РазделительКлассификации,
	|	НЕОПРЕДЕЛЕНО КАК РазделКлассификации,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыОбъектовКлассификации.ТорговоеНаименование_ФормаВыпуска) КАК ТипОбъектаКлассификации,
	|	ВЫБОР 
	|		КОГДА ИсточникДанных.ТорговоеНаименование = ЗНАЧЕНИЕ(Справочник.ТорговыеНаименования.ПустаяСсылка)
	|			ТОГДА ИсточникДанных.Номенклатура
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|	КОНЕЦ КАК Номенклатура,
	|	ИсточникДанных.ТорговоеНаименование КАК ТорговоеНаименование,
	|	ИсточникДанных.ДействующиеВеществаМНН КАК ДействующиеВеществаМНН,
	|	ИсточникДанных.ФормаВыпуска КАК ФормаВыпуска,
	|	ИсточникДанных.АналитикаОписанияТорговогоНаименования КАК ОбъектКлассификации,
	|	СУММА(ИсточникДанных.Сумма) КАК Сумма,
	|	СУММА(Количество) КАК Количество
	|ИЗ
	|	ИсточникДанных КАК ИсточникДанных
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР 
	|		КОГДА ИсточникДанных.ТорговоеНаименование = ЗНАЧЕНИЕ(Справочник.ТорговыеНаименования.ПустаяСсылка)
	|			ТОГДА ИсточникДанных.Номенклатура
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|	КОНЕЦ,
	|	ИсточникДанных.ТорговоеНаименование,
	|	ИсточникДанных.ДействующиеВеществаМНН,
	|	ИсточникДанных.ФормаВыпуска,
	|	ИсточникДанных.АналитикаОписанияТорговогоНаименования
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	// 2.2 Данные для классификация в разрезе организаций
	|ВЫБРАТЬ
	|	1,
	|	ИсточникДанных.Организация,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыОбъектовКлассификации.ТорговоеНаименование_ФормаВыпуска),
	|	ВЫБОР 
	|		КОГДА ИсточникДанных.ТорговоеНаименование = ЗНАЧЕНИЕ(Справочник.ТорговыеНаименования.ПустаяСсылка)
	|			ТОГДА ИсточникДанных.Номенклатура
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|	КОНЕЦ,
	|	ИсточникДанных.ТорговоеНаименование,
	|	ИсточникДанных.ДействующиеВеществаМНН,
	|	ИсточникДанных.ФормаВыпуска,
	|	ИсточникДанных.АналитикаОписанияТорговогоНаименования,
	|	СУММА(ИсточникДанных.Сумма),
	|	СУММА(Количество)
	|ИЗ
	|	ИсточникДанных КАК ИсточникДанных
	|
	|СГРУППИРОВАТЬ ПО
	|	ИсточникДанных.Организация,
	|	ВЫБОР 
	|		КОГДА ИсточникДанных.ТорговоеНаименование = ЗНАЧЕНИЕ(Справочник.ТорговыеНаименования.ПустаяСсылка)
	|			ТОГДА ИсточникДанных.Номенклатура
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|	КОНЕЦ,
	|	ИсточникДанных.ТорговоеНаименование,
	|	ИсточникДанных.ДействующиеВеществаМНН,
	|	ИсточникДанных.ФормаВыпуска,
	|	ИсточникДанных.АналитикаОписанияТорговогоНаименования
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	// 2.3 Данные для классификация в разрезе подразделений организаций
	|ВЫБРАТЬ
	|	2,
	|	ИсточникДанных.ПодразделениеОрганизации,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыОбъектовКлассификации.ТорговоеНаименование_ФормаВыпуска),
	|	ВЫБОР 
	|		КОГДА ИсточникДанных.ТорговоеНаименование = ЗНАЧЕНИЕ(Справочник.ТорговыеНаименования.ПустаяСсылка)
	|			ТОГДА ИсточникДанных.Номенклатура
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|	КОНЕЦ,
	|	ИсточникДанных.ТорговоеНаименование,
	|	ИсточникДанных.ДействующиеВеществаМНН,
	|	ИсточникДанных.ФормаВыпуска,
	|	ИсточникДанных.АналитикаОписанияТорговогоНаименования,
	|	СУММА(ИсточникДанных.Сумма),
	|	СУММА(Количество)
	|ИЗ
	|	ИсточникДанных КАК ИсточникДанных
	|
	|СГРУППИРОВАТЬ ПО
	|	ИсточникДанных.ПодразделениеОрганизации,
	|	ВЫБОР 
	|		КОГДА ИсточникДанных.ТорговоеНаименование = ЗНАЧЕНИЕ(Справочник.ТорговыеНаименования.ПустаяСсылка)
	|			ТОГДА ИсточникДанных.Номенклатура
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|	КОНЕЦ,
	|	ИсточникДанных.ТорговоеНаименование,
	|	ИсточникДанных.ДействующиеВеществаМНН,
	|	ИсточникДанных.ФормаВыпуска,
	|	ИсточникДанных.АналитикаОписанияТорговогоНаименования
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	// 3 Классификация Торговых наименований
	// 3.1 Данные для классификация в целом по предприятию
	|ВЫБРАТЬ
	|	0 КАК РазделительКлассификации,
	|	НЕОПРЕДЕЛЕНО КАК РазделКлассификации,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыОбъектовКлассификации.ТорговоеНаименование) КАК ТипОбъектаКлассификации,
	|	ВЫБОР 
	|		КОГДА ИсточникДанных.ТорговоеНаименование = ЗНАЧЕНИЕ(Справочник.ТорговыеНаименования.ПустаяСсылка)
	|			ТОГДА ИсточникДанных.Номенклатура
	|		ИНАЧЕ ИсточникДанных.ТорговоеНаименование
	|	КОНЕЦ КАК ОбъектКлассификации,
	|	СУММА(ИсточникДанных.Сумма) КАК Сумма,
	|	СУММА(Количество) КАК Количество
	|ИЗ
	|	ИсточникДанных КАК ИсточникДанных
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР 
	|		КОГДА ИсточникДанных.ТорговоеНаименование = ЗНАЧЕНИЕ(Справочник.ТорговыеНаименования.ПустаяСсылка)
	|			ТОГДА ИсточникДанных.Номенклатура
	|		ИНАЧЕ ИсточникДанных.ТорговоеНаименование
	|	КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	// 3.2 Данные для классификация в разрезе организаций
	|ВЫБРАТЬ
	|	1,
	|	ИсточникДанных.Организация,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыОбъектовКлассификации.ТорговоеНаименование),
	|	ВЫБОР 
	|		КОГДА ИсточникДанных.ТорговоеНаименование = ЗНАЧЕНИЕ(Справочник.ТорговыеНаименования.ПустаяСсылка)
	|			ТОГДА ИсточникДанных.Номенклатура
	|		ИНАЧЕ ИсточникДанных.ТорговоеНаименование
	|	КОНЕЦ КАК ОбъектКлассификации,
	|	СУММА(ИсточникДанных.Сумма),
	|	СУММА(Количество)
	|ИЗ
	|	ИсточникДанных КАК ИсточникДанных
	|
	|СГРУППИРОВАТЬ ПО
	|	ИсточникДанных.Организация,
	|	ВЫБОР 
	|		КОГДА ИсточникДанных.ТорговоеНаименование = ЗНАЧЕНИЕ(Справочник.ТорговыеНаименования.ПустаяСсылка)
	|			ТОГДА ИсточникДанных.Номенклатура
	|		ИНАЧЕ ИсточникДанных.ТорговоеНаименование
	|	КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	// 3.3 Данные для классификация в разрезе подразделений организаций
	|ВЫБРАТЬ
	|	2,
	|	ИсточникДанных.ПодразделениеОрганизации,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыОбъектовКлассификации.ТорговоеНаименование),
	|	ВЫБОР 
	|		КОГДА ИсточникДанных.ТорговоеНаименование = ЗНАЧЕНИЕ(Справочник.ТорговыеНаименования.ПустаяСсылка)
	|			ТОГДА ИсточникДанных.Номенклатура
	|		ИНАЧЕ ИсточникДанных.ТорговоеНаименование
	|	КОНЕЦ КАК ОбъектКлассификации,
	|	СУММА(ИсточникДанных.Сумма),
	|	СУММА(Количество)
	|ИЗ
	|	ИсточникДанных КАК ИсточникДанных
	|
	|СГРУППИРОВАТЬ ПО
	|	ИсточникДанных.ПодразделениеОрганизации,
	|	ВЫБОР 
	|		КОГДА ИсточникДанных.ТорговоеНаименование = ЗНАЧЕНИЕ(Справочник.ТорговыеНаименования.ПустаяСсылка)
	|			ТОГДА ИсточникДанных.Номенклатура
	|		ИНАЧЕ ИсточникДанных.ТорговоеНаименование
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	// 4 Классификация Действующих веществ(МНН) + формы выпуска
	// 4.1 Данные для классификация в целом по предприятию
	|ВЫБРАТЬ
	|	0 КАК РазделительКлассификации,
	|	НЕОПРЕДЕЛЕНО КАК РазделКлассификации,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыОбъектовКлассификации.ДействующиеВеществаМНН_ФормаВыпуска) КАК ТипОбъектаКлассификации,
	|	ВЫБОР 
	|		КОГДА ИсточникДанных.ТорговоеНаименование = ЗНАЧЕНИЕ(Справочник.ТорговыеНаименования.ПустаяСсылка)
	|				И ИсточникДанных.ДействующиеВеществаМНН = ЗНАЧЕНИЕ(Справочник.ДействующиеВеществаМНН.ПустаяСсылка)
	|			ТОГДА ИсточникДанных.Номенклатура
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|	КОНЕЦ КАК Номенклатура,
	|	ВЫБОР 
	|		КОГДА ИсточникДанных.ДействующиеВеществаМНН = ЗНАЧЕНИЕ(Справочник.ДействующиеВеществаМНН.ПустаяСсылка)
	|			ТОГДА ИсточникДанных.ТорговоеНаименование
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ТорговыеНаименования.ПустаяСсылка)
	|	КОНЕЦ КАК ТорговоеНаименование,
	|	ИсточникДанных.ДействующиеВеществаМНН КАК ДействующиеВеществаМНН,
	|	ИсточникДанных.ФормаВыпуска КАК ФормаВыпуска,
	|	ИсточникДанных.АналитикаОписанияДействующихВеществМНН КАК ОбъектКлассификации,
	|	СУММА(ИсточникДанных.Сумма) КАК Сумма,
	|	СУММА(Количество) КАК Количество
	|ИЗ
	|	ИсточникДанных КАК ИсточникДанных
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР 
	|		КОГДА ИсточникДанных.ТорговоеНаименование = ЗНАЧЕНИЕ(Справочник.ТорговыеНаименования.ПустаяСсылка)
	|				И ИсточникДанных.ДействующиеВеществаМНН = ЗНАЧЕНИЕ(Справочник.ДействующиеВеществаМНН.ПустаяСсылка)
	|			ТОГДА ИсточникДанных.Номенклатура
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР 
	|		КОГДА ИсточникДанных.ДействующиеВеществаМНН = ЗНАЧЕНИЕ(Справочник.ДействующиеВеществаМНН.ПустаяСсылка)
	|			ТОГДА ИсточникДанных.ТорговоеНаименование
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ТорговыеНаименования.ПустаяСсылка)
	|	КОНЕЦ,
	|	ИсточникДанных.ДействующиеВеществаМНН,
	|	ИсточникДанных.ФормаВыпуска,
	|	ИсточникДанных.АналитикаОписанияДействующихВеществМНН
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	// 4.2 Данные для классификация в разрезе организаций
	|ВЫБРАТЬ
	|	1,
	|	ИсточникДанных.Организация,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыОбъектовКлассификации.ДействующиеВеществаМНН_ФормаВыпуска),
	|	ВЫБОР 
	|		КОГДА ИсточникДанных.ТорговоеНаименование = ЗНАЧЕНИЕ(Справочник.ТорговыеНаименования.ПустаяСсылка)
	|				И ИсточникДанных.ДействующиеВеществаМНН = ЗНАЧЕНИЕ(Справочник.ДействующиеВеществаМНН.ПустаяСсылка)
	|			ТОГДА ИсточникДанных.Номенклатура
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР 
	|		КОГДА ИсточникДанных.ДействующиеВеществаМНН = ЗНАЧЕНИЕ(Справочник.ДействующиеВеществаМНН.ПустаяСсылка)
	|			ТОГДА ИсточникДанных.ТорговоеНаименование
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ТорговыеНаименования.ПустаяСсылка)
	|	КОНЕЦ,
	|	ИсточникДанных.ДействующиеВеществаМНН,
	|	ИсточникДанных.ФормаВыпуска,
	|	ИсточникДанных.АналитикаОписанияДействующихВеществМНН,
	|	СУММА(ИсточникДанных.Сумма),
	|	СУММА(Количество)
	|ИЗ
	|	ИсточникДанных КАК ИсточникДанных
	|
	|СГРУППИРОВАТЬ ПО
	|	ИсточникДанных.Организация,
	|	ВЫБОР 
	|		КОГДА ИсточникДанных.ТорговоеНаименование = ЗНАЧЕНИЕ(Справочник.ТорговыеНаименования.ПустаяСсылка)
	|				И ИсточникДанных.ДействующиеВеществаМНН = ЗНАЧЕНИЕ(Справочник.ДействующиеВеществаМНН.ПустаяСсылка)
	|			ТОГДА ИсточникДанных.Номенклатура
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР 
	|		КОГДА ИсточникДанных.ДействующиеВеществаМНН = ЗНАЧЕНИЕ(Справочник.ДействующиеВеществаМНН.ПустаяСсылка)
	|			ТОГДА ИсточникДанных.ТорговоеНаименование
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ТорговыеНаименования.ПустаяСсылка)
	|	КОНЕЦ,
	|	ИсточникДанных.ДействующиеВеществаМНН,
	|	ИсточникДанных.ФормаВыпуска,
	|	ИсточникДанных.АналитикаОписанияДействующихВеществМНН
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	// 4.3 Данные для классификация в разрезе подразделений организаций
	|ВЫБРАТЬ
	|	2,
	|	ИсточникДанных.ПодразделениеОрганизации,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыОбъектовКлассификации.ДействующиеВеществаМНН_ФормаВыпуска),
	|	ВЫБОР 
	|		КОГДА ИсточникДанных.ТорговоеНаименование = ЗНАЧЕНИЕ(Справочник.ТорговыеНаименования.ПустаяСсылка)
	|				И ИсточникДанных.ДействующиеВеществаМНН = ЗНАЧЕНИЕ(Справочник.ДействующиеВеществаМНН.ПустаяСсылка)
	|			ТОГДА ИсточникДанных.Номенклатура
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР 
	|		КОГДА ИсточникДанных.ДействующиеВеществаМНН = ЗНАЧЕНИЕ(Справочник.ДействующиеВеществаМНН.ПустаяСсылка)
	|			ТОГДА ИсточникДанных.ТорговоеНаименование
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ТорговыеНаименования.ПустаяСсылка)
	|	КОНЕЦ,
	|	ИсточникДанных.ДействующиеВеществаМНН,
	|	ИсточникДанных.ФормаВыпуска,
	|	ИсточникДанных.АналитикаОписанияДействующихВеществМНН,
	|	СУММА(ИсточникДанных.Сумма),
	|	СУММА(Количество)
	|ИЗ
	|	ИсточникДанных КАК ИсточникДанных
	|
	|СГРУППИРОВАТЬ ПО
	|	ИсточникДанных.ПодразделениеОрганизации,
	|	ВЫБОР 
	|		КОГДА ИсточникДанных.ТорговоеНаименование = ЗНАЧЕНИЕ(Справочник.ТорговыеНаименования.ПустаяСсылка)
	|				И ИсточникДанных.ДействующиеВеществаМНН = ЗНАЧЕНИЕ(Справочник.ДействующиеВеществаМНН.ПустаяСсылка)
	|			ТОГДА ИсточникДанных.Номенклатура
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР 
	|		КОГДА ИсточникДанных.ДействующиеВеществаМНН = ЗНАЧЕНИЕ(Справочник.ДействующиеВеществаМНН.ПустаяСсылка)
	|			ТОГДА ИсточникДанных.ТорговоеНаименование
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ТорговыеНаименования.ПустаяСсылка)
	|	КОНЕЦ,
	|	ИсточникДанных.ДействующиеВеществаМНН,
	|	ИсточникДанных.ФормаВыпуска,
	|	ИсточникДанных.АналитикаОписанияДействующихВеществМНН
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	// 5 Классификация Действующих веществ(МНН)
	// 5.1 Данные для классификация в целом по предприятию
	|ВЫБРАТЬ
	|	0 КАК РазделительКлассификации,
	|	НЕОПРЕДЕЛЕНО КАК РазделКлассификации,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыОбъектовКлассификации.ДействующиеВеществаМНН) КАК ТипОбъектаКлассификации,
	|	ВЫБОР 
	|		КОГДА ИсточникДанных.ТорговоеНаименование = ЗНАЧЕНИЕ(Справочник.ТорговыеНаименования.ПустаяСсылка)
	|				И ИсточникДанных.ДействующиеВеществаМНН = ЗНАЧЕНИЕ(Справочник.ДействующиеВеществаМНН.ПустаяСсылка)
	|			ТОГДА ИсточникДанных.Номенклатура
	|		КОГДА ИсточникДанных.ДействующиеВеществаМНН = ЗНАЧЕНИЕ(Справочник.ДействующиеВеществаМНН.ПустаяСсылка)
	|			ТОГДА ИсточникДанных.ТорговоеНаименование
	|		ИНАЧЕ ИсточникДанных.ДействующиеВеществаМНН
	|	КОНЕЦ КАК ОбъектКлассификации,
	|	СУММА(ИсточникДанных.Сумма) КАК Сумма,
	|	СУММА(Количество) КАК Количество
	|ИЗ
	|	ИсточникДанных КАК ИсточникДанных
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР 
	|		КОГДА ИсточникДанных.ТорговоеНаименование = ЗНАЧЕНИЕ(Справочник.ТорговыеНаименования.ПустаяСсылка)
	|				И ИсточникДанных.ДействующиеВеществаМНН = ЗНАЧЕНИЕ(Справочник.ДействующиеВеществаМНН.ПустаяСсылка)
	|			ТОГДА ИсточникДанных.Номенклатура
	|		КОГДА ИсточникДанных.ДействующиеВеществаМНН = ЗНАЧЕНИЕ(Справочник.ДействующиеВеществаМНН.ПустаяСсылка)
	|			ТОГДА ИсточникДанных.ТорговоеНаименование
	|		ИНАЧЕ ИсточникДанных.ДействующиеВеществаМНН
	|	КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	// 5.2 Данные для классификация в разрезе организаций
	|ВЫБРАТЬ
	|	1,
	|	ИсточникДанных.Организация,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыОбъектовКлассификации.ДействующиеВеществаМНН),
	|	ВЫБОР 
	|		КОГДА ИсточникДанных.ТорговоеНаименование = ЗНАЧЕНИЕ(Справочник.ТорговыеНаименования.ПустаяСсылка)
	|				И ИсточникДанных.ДействующиеВеществаМНН = ЗНАЧЕНИЕ(Справочник.ДействующиеВеществаМНН.ПустаяСсылка)
	|			ТОГДА ИсточникДанных.Номенклатура
	|		КОГДА ИсточникДанных.ДействующиеВеществаМНН = ЗНАЧЕНИЕ(Справочник.ДействующиеВеществаМНН.ПустаяСсылка)
	|			ТОГДА ИсточникДанных.ТорговоеНаименование
	|		ИНАЧЕ ИсточникДанных.ДействующиеВеществаМНН
	|	КОНЕЦ,
	|	СУММА(ИсточникДанных.Сумма),
	|	СУММА(Количество)
	|ИЗ
	|	ИсточникДанных КАК ИсточникДанных
	|
	|СГРУППИРОВАТЬ ПО
	|	ИсточникДанных.Организация,
	|	ВЫБОР 
	|		КОГДА ИсточникДанных.ТорговоеНаименование = ЗНАЧЕНИЕ(Справочник.ТорговыеНаименования.ПустаяСсылка)
	|				И ИсточникДанных.ДействующиеВеществаМНН = ЗНАЧЕНИЕ(Справочник.ДействующиеВеществаМНН.ПустаяСсылка)
	|			ТОГДА ИсточникДанных.Номенклатура
	|		КОГДА ИсточникДанных.ДействующиеВеществаМНН = ЗНАЧЕНИЕ(Справочник.ДействующиеВеществаМНН.ПустаяСсылка)
	|			ТОГДА ИсточникДанных.ТорговоеНаименование
	|		ИНАЧЕ ИсточникДанных.ДействующиеВеществаМНН
	|	КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	// 5.3 Данные для классификация в разрезе подразделений организаций
	|ВЫБРАТЬ
	|	2,
	|	ИсточникДанных.ПодразделениеОрганизации,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыОбъектовКлассификации.ДействующиеВеществаМНН),
	|	ВЫБОР 
	|		КОГДА ИсточникДанных.ТорговоеНаименование = ЗНАЧЕНИЕ(Справочник.ТорговыеНаименования.ПустаяСсылка)
	|				И ИсточникДанных.ДействующиеВеществаМНН = ЗНАЧЕНИЕ(Справочник.ДействующиеВеществаМНН.ПустаяСсылка)
	|			ТОГДА ИсточникДанных.Номенклатура
	|		КОГДА ИсточникДанных.ДействующиеВеществаМНН = ЗНАЧЕНИЕ(Справочник.ДействующиеВеществаМНН.ПустаяСсылка)
	|			ТОГДА ИсточникДанных.ТорговоеНаименование
	|		ИНАЧЕ ИсточникДанных.ДействующиеВеществаМНН
	|	КОНЕЦ,
	|	СУММА(ИсточникДанных.Сумма),
	|	СУММА(Количество)
	|ИЗ
	|	ИсточникДанных КАК ИсточникДанных
	|
	|СГРУППИРОВАТЬ ПО
	|	ИсточникДанных.ПодразделениеОрганизации,
	|	ВЫБОР 
	|		КОГДА ИсточникДанных.ТорговоеНаименование = ЗНАЧЕНИЕ(Справочник.ТорговыеНаименования.ПустаяСсылка)
	|				И ИсточникДанных.ДействующиеВеществаМНН = ЗНАЧЕНИЕ(Справочник.ДействующиеВеществаМНН.ПустаяСсылка)
	|			ТОГДА ИсточникДанных.Номенклатура
	|		КОГДА ИсточникДанных.ДействующиеВеществаМНН = ЗНАЧЕНИЕ(Справочник.ДействующиеВеществаМНН.ПустаяСсылка)
	|			ТОГДА ИсточникДанных.ТорговоеНаименование
	|		ИНАЧЕ ИсточникДанных.ДействующиеВеществаМНН
	|	КОНЕЦ
	|";
	
	Период = КлассификацияБольничнаяАптека.РасширенныйПериод(?(ДатаКлассификации = Неопределено, ТекущаяДатаСеанса(), ДатаКлассификации), ПериодКлассификации, -КоличествоПериодовКлассификации);
	Запрос.УстановитьПараметр("НачалоПериода", Период.ДатаНачала);
	Запрос.УстановитьПараметр("ОкончаниеПериода", Период.ДатаОкончания);
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	РезультатыКлассификации = Запрос.ВыполнитьПакет();
	
	РезультатКлассификацииНоменклатура = РезультатыКлассификации[1].Выгрузить();
	РезультатКлассификацииТорговоеНаименованиеФормаВыпуска = РезультатыКлассификации[2].Выгрузить();
	РезультатКлассификацииТорговоеНаименование = РезультатыКлассификации[3].Выгрузить();
	РезультатКлассификацииДействующиеВеществаМННФормаВыпуска = РезультатыКлассификации[4].Выгрузить();
	РезультатКлассификацииДействующиеВеществаМНН = РезультатыКлассификации[5].Выгрузить();
	
	Если ИспользоватьABCКлассификациюПоСуммеЗакупок Тогда
		
		КлассификацияБольничнаяАптека.ВыполнитьABCКлассификацию(РезультатКлассификацииНоменклатура, "Сумма");
		КлассификацияБольничнаяАптека.ВыполнитьABCКлассификацию(РезультатКлассификацииТорговоеНаименованиеФормаВыпуска, "Сумма");
		КлассификацияБольничнаяАптека.ВыполнитьABCКлассификацию(РезультатКлассификацииТорговоеНаименование, "Сумма");
		КлассификацияБольничнаяАптека.ВыполнитьABCКлассификацию(РезультатКлассификацииДействующиеВеществаМННФормаВыпуска, "Сумма");
		КлассификацияБольничнаяАптека.ВыполнитьABCКлассификацию(РезультатКлассификацииДействующиеВеществаМНН, "Сумма");
		
		ОбновитьДанныеКлассификации(
			РезультатКлассификацииНоменклатура,
			Перечисления.ТипыОбъектовКлассификации.Номенклатура,
			Перечисления.ТипыПараметровКлассификации.ЗакупкиСумма,
			ОбщегоНазначенияБольничнаяАптекаКлиентСервер.ДобавитьКДате(Период.ДатаОкончания, "СЕКУНДА", 1),
			Перечисления.ABCКлассификация.НеКлассифицирован);
		ОбновитьДанныеКлассификации(
			РезультатКлассификацииТорговоеНаименованиеФормаВыпуска,
			Перечисления.ТипыОбъектовКлассификации.ТорговоеНаименование_ФормаВыпуска,
			Перечисления.ТипыПараметровКлассификации.ЗакупкиСумма,
			ОбщегоНазначенияБольничнаяАптекаКлиентСервер.ДобавитьКДате(Период.ДатаОкончания, "СЕКУНДА", 1),
			Перечисления.ABCКлассификация.НеКлассифицирован);
		ОбновитьДанныеКлассификации(
			РезультатКлассификацииТорговоеНаименование,
			Перечисления.ТипыОбъектовКлассификации.ТорговоеНаименование,
			Перечисления.ТипыПараметровКлассификации.ЗакупкиСумма,
			ОбщегоНазначенияБольничнаяАптекаКлиентСервер.ДобавитьКДате(Период.ДатаОкончания, "СЕКУНДА", 1),
			Перечисления.ABCКлассификация.НеКлассифицирован);
		ОбновитьДанныеКлассификации(
			РезультатКлассификацииДействующиеВеществаМННФормаВыпуска,
			Перечисления.ТипыОбъектовКлассификации.ДействующиеВеществаМНН_ФормаВыпуска,
			Перечисления.ТипыПараметровКлассификации.ЗакупкиСумма,
			ОбщегоНазначенияБольничнаяАптекаКлиентСервер.ДобавитьКДате(Период.ДатаОкончания, "СЕКУНДА", 1),
			Перечисления.ABCКлассификация.НеКлассифицирован);
		ОбновитьДанныеКлассификации(
			РезультатКлассификацииДействующиеВеществаМНН,
			Перечисления.ТипыОбъектовКлассификации.ДействующиеВеществаМНН,
			Перечисления.ТипыПараметровКлассификации.ЗакупкиСумма,
			ОбщегоНазначенияБольничнаяАптекаКлиентСервер.ДобавитьКДате(Период.ДатаОкончания, "СЕКУНДА", 1),
			Перечисления.ABCКлассификация.НеКлассифицирован);
		
	КонецЕсли;
	
	Если ИспользоватьABCКлассификациюПоКоличествуЗакупок Тогда
		
		КлассификацияБольничнаяАптека.ВыполнитьABCКлассификацию(РезультатКлассификацииНоменклатура, "Количество");
		КлассификацияБольничнаяАптека.ВыполнитьABCКлассификацию(РезультатКлассификацииТорговоеНаименованиеФормаВыпуска, "Количество");
		КлассификацияБольничнаяАптека.ВыполнитьABCКлассификацию(РезультатКлассификацииТорговоеНаименование, "Количество");
		КлассификацияБольничнаяАптека.ВыполнитьABCКлассификацию(РезультатКлассификацииДействующиеВеществаМННФормаВыпуска, "Количество");
		КлассификацияБольничнаяАптека.ВыполнитьABCКлассификацию(РезультатКлассификацииДействующиеВеществаМНН, "Количество");
		
		ОбновитьДанныеКлассификации(
			РезультатКлассификацииНоменклатура,
			Перечисления.ТипыОбъектовКлассификации.Номенклатура,
			Перечисления.ТипыПараметровКлассификации.ЗакупкиКоличество,
			ОбщегоНазначенияБольничнаяАптекаКлиентСервер.ДобавитьКДате(Период.ДатаОкончания, "СЕКУНДА", 1),
			Перечисления.ABCКлассификация.НеКлассифицирован);
		ОбновитьДанныеКлассификации(
			РезультатКлассификацииТорговоеНаименованиеФормаВыпуска,
			Перечисления.ТипыОбъектовКлассификации.ТорговоеНаименование_ФормаВыпуска,
			Перечисления.ТипыПараметровКлассификации.ЗакупкиКоличество,
			ОбщегоНазначенияБольничнаяАптекаКлиентСервер.ДобавитьКДате(Период.ДатаОкончания, "СЕКУНДА", 1),
			Перечисления.ABCКлассификация.НеКлассифицирован);
		ОбновитьДанныеКлассификации(
			РезультатКлассификацииТорговоеНаименование,
			Перечисления.ТипыОбъектовКлассификации.ТорговоеНаименование,
			Перечисления.ТипыПараметровКлассификации.ЗакупкиКоличество,
			ОбщегоНазначенияБольничнаяАптекаКлиентСервер.ДобавитьКДате(Период.ДатаОкончания, "СЕКУНДА", 1),
			Перечисления.ABCКлассификация.НеКлассифицирован);
		ОбновитьДанныеКлассификации(
			РезультатКлассификацииДействующиеВеществаМННФормаВыпуска,
			Перечисления.ТипыОбъектовКлассификации.ДействующиеВеществаМНН_ФормаВыпуска,
			Перечисления.ТипыПараметровКлассификации.ЗакупкиКоличество,
			ОбщегоНазначенияБольничнаяАптекаКлиентСервер.ДобавитьКДате(Период.ДатаОкончания, "СЕКУНДА", 1),
			Перечисления.ABCКлассификация.НеКлассифицирован);
		ОбновитьДанныеКлассификации(
			РезультатКлассификацииДействующиеВеществаМНН,
			Перечисления.ТипыОбъектовКлассификации.ДействующиеВеществаМНН,
			Перечисления.ТипыПараметровКлассификации.ЗакупкиКоличество,
			ОбщегоНазначенияБольничнаяАптекаКлиентСервер.ДобавитьКДате(Период.ДатаОкончания, "СЕКУНДА", 1),
			Перечисления.ABCКлассификация.НеКлассифицирован);
	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти // ПрограммныйИнтерфейс

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ
#Область СлужебныеПроцедурыИФункции

Процедура ОбновитьДанныеКлассификации(РезультатКлассификации, ТипОбъектаКлассификации, ТипПараметраКлассификации, ПериодКлассификации, НеКлассифицирован)
	
	Если РезультатКлассификации.Колонки.Найти("Период") = Неопределено Тогда
		РезультатКлассификации.Колонки.Добавить("Период");
	КонецЕсли;
	
	Если РезультатКлассификации.Колонки.Найти("ТипПараметраКлассификации") = Неопределено Тогда
		РезультатКлассификации.Колонки.Добавить("ТипПараметраКлассификации");
	КонецЕсли;
	
	Если РезультатКлассификации.Колонки.Найти("ТипОбъектаКлассификации") = Неопределено Тогда
		РезультатКлассификации.Колонки.Добавить("ТипОбъектаКлассификации");
	КонецЕсли;
	
	Если РезультатКлассификации.Колонки.Найти("ОбъектКлассификации") = Неопределено Тогда
		РезультатКлассификации.Колонки.Добавить("ОбъектКлассификации");
	КонецЕсли;
	
	РезультатКлассификации.ЗаполнитьЗначения(ПериодКлассификации, "Период");
	РезультатКлассификации.ЗаполнитьЗначения(ТипПараметраКлассификации, "ТипПараметраКлассификации");
	РезультатКлассификации.ЗаполнитьЗначения(ТипОбъектаКлассификации, "ТипОбъектаКлассификации");

	Для Каждого ДанныеКлассификации Из РезультатКлассификации Цикл
		Если ДанныеКлассификации.ОбъектКлассификации = Неопределено Тогда
			
			ДанныеКлассификации.ОбъектКлассификации 
				= Справочники.КлючиАналитикиОписанийОтборовНоменклатуры.ЗначениеКлючаАналитики(ДанныеКлассификации);
			
		КонецЕсли;
	КонецЦикла;
	
	НаборЗаписей = РегистрыСведений.ABCКлассификацияНоменклатуры.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Период.Установить(ПериодКлассификации);
	НаборЗаписей.Отбор.ТипОбъектаКлассификации.Установить(ТипОбъектаКлассификации);
	НаборЗаписей.Отбор.ТипПараметраКлассификации.Установить(ТипПараметраКлассификации);

	НаборЗаписей.Загрузить(РезультатКлассификации);
	НаборЗаписей.Записать(Истина);
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ABCКлассификацияНоменклатуры.ОбъектКлассификации КАК ОбъектКлассификации,
	|	ABCКлассификацияНоменклатуры.РазделКлассификации КАК РазделКлассификации
	|ПОМЕСТИТЬ РезультатКлассификации
	|ИЗ
	|	РегистрСведений.ABCКлассификацияНоменклатуры КАК ABCКлассификацияНоменклатуры
	|ГДЕ
	|	ABCКлассификацияНоменклатуры.Период = &ПериодКлассификации
	|	И ABCКлассификацияНоменклатуры.ТипПараметраКлассификации = &ТипПараметраКлассификации
	|	И ABCКлассификацияНоменклатуры.ТипОбъектаКлассификации = &ТипОбъектаКлассификации
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОбъектКлассификации,
	|	РазделКлассификации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&ПериодКлассификации КАК Период,
	|	ABCКлассификацияНоменклатурыСрезПоследних.ОбъектКлассификации КАК ОбъектКлассификации,
	|	ABCКлассификацияНоменклатурыСрезПоследних.РазделКлассификации КАК РазделКлассификации,
	|	ABCКлассификацияНоменклатурыСрезПоследних.ТипПараметраКлассификации КАК ТипПараметраКлассификации,
	|	ABCКлассификацияНоменклатурыСрезПоследних.ТипОбъектаКлассификации КАК ТипОбъектаКлассификации,
	|	ABCКлассификацияНоменклатурыСрезПоследних.Класс КАК СтарыйКласс,
	|	&НеКлассифицирован КАК Класс,
	|	0 КАК ЗначениеПараметраКлассификации
	|ИЗ
	|	РегистрСведений.ABCКлассификацияНоменклатуры.СрезПоследних(
	|			ДОБАВИТЬКДАТЕ(&ПериодКлассификации, СЕКУНДА, -1),
	|			(НЕ (ОбъектКлассификации, РазделКлассификации) В
	|						(ВЫБРАТЬ
	|							РезультатКлассификации.ОбъектКлассификации КАК ОбъектКлассификации,
	|							РезультатКлассификации.РазделКлассификации КАК РазделКлассификации
	|						ИЗ
	|							РезультатКлассификации КАК РезультатКлассификации))
	|				И ТипПараметраКлассификации = &ТипПараметраКлассификации
	|				И ТипОбъектаКлассификации = &ТипОбъектаКлассификации) КАК ABCКлассификацияНоменклатурыСрезПоследних
	|ГДЕ
	|	НЕ ABCКлассификацияНоменклатурыСрезПоследних.Класс = &НеКлассифицирован");
	
	Запрос.УстановитьПараметр("ПериодКлассификации", ПериодКлассификации);
	Запрос.УстановитьПараметр("ТипОбъектаКлассификации", ТипОбъектаКлассификации);
	Запрос.УстановитьПараметр("ТипПараметраКлассификации", ТипПараметраКлассификации);
	Запрос.УстановитьПараметр("НеКлассифицирован", НеКлассифицирован);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		НаборЗаписей.Загрузить(РезультатЗапроса.Выгрузить());
		НаборЗаписей.Записать(Ложь);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти // СлужебныеПроцедурыИФункции

#КонецЕсли
